// Generated by jextract

package net.nailuj.win;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _STORAGE_CRYPTO_DESCRIPTOR_V2 {
 *     DWORD Version;
 *     DWORD Size;
 *     DWORD NumKeysSupported;
 *     DWORD NumCryptoCapabilities;
 *     STORAGE_ICE_TYPE IceType;
 *     STORAGE_SECURITY_COMPLIANCE_BITMASK SecurityComplianceBitmask;
 *     STORAGE_CRYPTO_KEY_TYPE KeyTypeBitmask;
 *     STORAGE_CRYPTO_CAPABILITY_V2 CryptoCapabilities[1];
 * }
 * }
 */
public class _STORAGE_CRYPTO_DESCRIPTOR_V2 {

    _STORAGE_CRYPTO_DESCRIPTOR_V2() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        winapi.C_LONG.withName("Version"),
        winapi.C_LONG.withName("Size"),
        winapi.C_LONG.withName("NumKeysSupported"),
        winapi.C_LONG.withName("NumCryptoCapabilities"),
        winapi.C_INT.withName("IceType"),
        _STORAGE_SECURITY_COMPLIANCE_BITMASK.layout().withName("SecurityComplianceBitmask"),
        _STORAGE_CRYPTO_KEY_TYPE.layout().withName("KeyTypeBitmask"),
        MemoryLayout.paddingLayout(2),
        MemoryLayout.sequenceLayout(1, _STORAGE_CRYPTO_CAPABILITY_V2.layout()).withName("CryptoCapabilities")
    ).withName("_STORAGE_CRYPTO_DESCRIPTOR_V2");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt Version$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Version"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final OfInt Version$layout() {
        return Version$LAYOUT;
    }

    private static final long Version$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static final long Version$offset() {
        return Version$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static int Version(MemorySegment struct) {
        return struct.get(Version$LAYOUT, Version$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Version
     * }
     */
    public static void Version(MemorySegment struct, int fieldValue) {
        struct.set(Version$LAYOUT, Version$OFFSET, fieldValue);
    }

    private static final OfInt Size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("Size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static final OfInt Size$layout() {
        return Size$LAYOUT;
    }

    private static final long Size$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static final long Size$offset() {
        return Size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static int Size(MemorySegment struct) {
        return struct.get(Size$LAYOUT, Size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD Size
     * }
     */
    public static void Size(MemorySegment struct, int fieldValue) {
        struct.set(Size$LAYOUT, Size$OFFSET, fieldValue);
    }

    private static final OfInt NumKeysSupported$LAYOUT = (OfInt)$LAYOUT.select(groupElement("NumKeysSupported"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD NumKeysSupported
     * }
     */
    public static final OfInt NumKeysSupported$layout() {
        return NumKeysSupported$LAYOUT;
    }

    private static final long NumKeysSupported$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD NumKeysSupported
     * }
     */
    public static final long NumKeysSupported$offset() {
        return NumKeysSupported$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD NumKeysSupported
     * }
     */
    public static int NumKeysSupported(MemorySegment struct) {
        return struct.get(NumKeysSupported$LAYOUT, NumKeysSupported$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD NumKeysSupported
     * }
     */
    public static void NumKeysSupported(MemorySegment struct, int fieldValue) {
        struct.set(NumKeysSupported$LAYOUT, NumKeysSupported$OFFSET, fieldValue);
    }

    private static final OfInt NumCryptoCapabilities$LAYOUT = (OfInt)$LAYOUT.select(groupElement("NumCryptoCapabilities"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DWORD NumCryptoCapabilities
     * }
     */
    public static final OfInt NumCryptoCapabilities$layout() {
        return NumCryptoCapabilities$LAYOUT;
    }

    private static final long NumCryptoCapabilities$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DWORD NumCryptoCapabilities
     * }
     */
    public static final long NumCryptoCapabilities$offset() {
        return NumCryptoCapabilities$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DWORD NumCryptoCapabilities
     * }
     */
    public static int NumCryptoCapabilities(MemorySegment struct) {
        return struct.get(NumCryptoCapabilities$LAYOUT, NumCryptoCapabilities$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DWORD NumCryptoCapabilities
     * }
     */
    public static void NumCryptoCapabilities(MemorySegment struct, int fieldValue) {
        struct.set(NumCryptoCapabilities$LAYOUT, NumCryptoCapabilities$OFFSET, fieldValue);
    }

    private static final OfInt IceType$LAYOUT = (OfInt)$LAYOUT.select(groupElement("IceType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * STORAGE_ICE_TYPE IceType
     * }
     */
    public static final OfInt IceType$layout() {
        return IceType$LAYOUT;
    }

    private static final long IceType$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * STORAGE_ICE_TYPE IceType
     * }
     */
    public static final long IceType$offset() {
        return IceType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * STORAGE_ICE_TYPE IceType
     * }
     */
    public static int IceType(MemorySegment struct) {
        return struct.get(IceType$LAYOUT, IceType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * STORAGE_ICE_TYPE IceType
     * }
     */
    public static void IceType(MemorySegment struct, int fieldValue) {
        struct.set(IceType$LAYOUT, IceType$OFFSET, fieldValue);
    }

    private static final GroupLayout SecurityComplianceBitmask$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("SecurityComplianceBitmask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * STORAGE_SECURITY_COMPLIANCE_BITMASK SecurityComplianceBitmask
     * }
     */
    public static final GroupLayout SecurityComplianceBitmask$layout() {
        return SecurityComplianceBitmask$LAYOUT;
    }

    private static final long SecurityComplianceBitmask$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * STORAGE_SECURITY_COMPLIANCE_BITMASK SecurityComplianceBitmask
     * }
     */
    public static final long SecurityComplianceBitmask$offset() {
        return SecurityComplianceBitmask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * STORAGE_SECURITY_COMPLIANCE_BITMASK SecurityComplianceBitmask
     * }
     */
    public static MemorySegment SecurityComplianceBitmask(MemorySegment struct) {
        return struct.asSlice(SecurityComplianceBitmask$OFFSET, SecurityComplianceBitmask$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * STORAGE_SECURITY_COMPLIANCE_BITMASK SecurityComplianceBitmask
     * }
     */
    public static void SecurityComplianceBitmask(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, SecurityComplianceBitmask$OFFSET, SecurityComplianceBitmask$LAYOUT.byteSize());
    }

    private static final GroupLayout KeyTypeBitmask$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("KeyTypeBitmask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * STORAGE_CRYPTO_KEY_TYPE KeyTypeBitmask
     * }
     */
    public static final GroupLayout KeyTypeBitmask$layout() {
        return KeyTypeBitmask$LAYOUT;
    }

    private static final long KeyTypeBitmask$OFFSET = 21;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * STORAGE_CRYPTO_KEY_TYPE KeyTypeBitmask
     * }
     */
    public static final long KeyTypeBitmask$offset() {
        return KeyTypeBitmask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * STORAGE_CRYPTO_KEY_TYPE KeyTypeBitmask
     * }
     */
    public static MemorySegment KeyTypeBitmask(MemorySegment struct) {
        return struct.asSlice(KeyTypeBitmask$OFFSET, KeyTypeBitmask$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * STORAGE_CRYPTO_KEY_TYPE KeyTypeBitmask
     * }
     */
    public static void KeyTypeBitmask(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, KeyTypeBitmask$OFFSET, KeyTypeBitmask$LAYOUT.byteSize());
    }

    private static final SequenceLayout CryptoCapabilities$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("CryptoCapabilities"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * STORAGE_CRYPTO_CAPABILITY_V2 CryptoCapabilities[1]
     * }
     */
    public static final SequenceLayout CryptoCapabilities$layout() {
        return CryptoCapabilities$LAYOUT;
    }

    private static final long CryptoCapabilities$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * STORAGE_CRYPTO_CAPABILITY_V2 CryptoCapabilities[1]
     * }
     */
    public static final long CryptoCapabilities$offset() {
        return CryptoCapabilities$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * STORAGE_CRYPTO_CAPABILITY_V2 CryptoCapabilities[1]
     * }
     */
    public static MemorySegment CryptoCapabilities(MemorySegment struct) {
        return struct.asSlice(CryptoCapabilities$OFFSET, CryptoCapabilities$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * STORAGE_CRYPTO_CAPABILITY_V2 CryptoCapabilities[1]
     * }
     */
    public static void CryptoCapabilities(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, CryptoCapabilities$OFFSET, CryptoCapabilities$LAYOUT.byteSize());
    }

    private static long[] CryptoCapabilities$DIMS = { 1 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * STORAGE_CRYPTO_CAPABILITY_V2 CryptoCapabilities[1]
     * }
     */
    public static long[] CryptoCapabilities$dimensions() {
        return CryptoCapabilities$DIMS;
    }
    private static final MethodHandle CryptoCapabilities$ELEM_HANDLE = CryptoCapabilities$LAYOUT.sliceHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * STORAGE_CRYPTO_CAPABILITY_V2 CryptoCapabilities[1]
     * }
     */
    public static MemorySegment CryptoCapabilities(MemorySegment struct, long index0) {
        try {
            return (MemorySegment)CryptoCapabilities$ELEM_HANDLE.invokeExact(struct, 0L, index0);
        } catch (Throwable ex$) {
            throw new AssertionError("should not reach here", ex$);
        }
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * STORAGE_CRYPTO_CAPABILITY_V2 CryptoCapabilities[1]
     * }
     */
    public static void CryptoCapabilities(MemorySegment struct, long index0, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, CryptoCapabilities(struct, index0), 0L, _STORAGE_CRYPTO_CAPABILITY_V2.layout().byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

